### CAN I USE FEATURE CONSTRUCTION?
### CAN I CREATE A NEW AND USEFUL FEATURE IN ORDER TO IMPROVE MY ACCURACY

In [1]:
import numpy as np
import pandas as pd
import seaborn as sns
from sklearn.model_selection import train_test_split , cross_val_score
from sklearn.linear_model import LogisticRegression

In [2]:
df = pd.read_csv("C:\\Users\\arups\\OneDrive\\Desktop\\COLLECTION\\PROGRAMS\\TEST_CSVs\\titanic.csv")[['Age','Pclass','SibSp','Parch','Survived']]
df.head()

    Age  Pclass  SibSp  Parch  Survived
0  22.0       3      1      0         0
1  38.0       1      1      0         1
2  26.0       3      0      0         1
3  35.0       1      1      0         1
4  35.0       3      0      0         0

In [3]:
df['Age'].fillna(df['Age'].mean() , inplace = True)

In [4]:
X = df.iloc[: , :4]
y = df.iloc[: , -1]

In [5]:
print(np.mean(cross_val_score(LogisticRegression() , X , y , cv = 20 , scoring = 'accuracy')))

0.6972222222222222

# Applying Feature Construction

In [6]:
X['Family_size'] = X['SibSp'] + X['Parch'] + 1 # +1 beacause of that person

In [7]:
def myfunc(num):
    
    if num == 1:
        return 0 # alone
    elif num > 1 and num <= 4:
        return 1 # small family
    else:
        return 2 # large family

In [8]:
X['Family_type'] = X['Family_size'].apply(myfunc)

In [9]:
X

           Age  Pclass  SibSp  Parch  Family_size  Family_type
0    22.000000       3      1      0            2            1
1    38.000000       1      1      0            2            1
2    26.000000       3      0      0            1            0
3    35.000000       1      1      0            2            1
4    35.000000       3      0      0            1            0
..         ...     ...    ...    ...          ...          ...
886  27.000000       2      0      0            1            0
887  19.000000       1      0      0            1            0
888  29.699118       3      1      2            4            1
889  26.000000       1      0      0            1            0
890  32.000000       3      0      0            1            0

[891 rows x 6 columns]

In [10]:
X.drop(['Family_size','SibSp','Parch'] ,axis = 1, inplace = True)

In [11]:
print(np.mean(cross_val_score(LogisticRegression() , X , y , cv = 20 , scoring = 'accuracy')))

0.7029797979797979

# Feature Splitting

In [12]:
df = pd.read_csv("C:\\Users\\arups\\OneDrive\\Desktop\\COLLECTION\\PROGRAMS\\TEST_CSVs\\titanic.csv")[['Name' , 'Survived']]
df.head()

                                                Name  Survived
0                            Braund, Mr. Owen Harris         0
1  Cumings, Mrs. John Bradley (Florence Briggs Th...         1
2                             Heikkinen, Miss. Laina         1
3       Futrelle, Mrs. Jacques Heath (Lily May Peel)         1
4                           Allen, Mr. William Henry         0

In [13]:
df['Title'] = df['Name'].str.split(',' , expand = True)[1].str.split('.' , expand = True)[0]

In [14]:
(df.groupby('Title')['Survived'].mean()).sort_values(ascending=False)

Title
 the Countess    1.000000
 Mlle            1.000000
 Sir             1.000000
 Ms              1.000000
 Lady            1.000000
 Mme             1.000000
 Mrs             0.792000
 Miss            0.697802
 Master          0.575000
 Col             0.500000
 Major           0.500000
 Dr              0.428571
 Mr              0.156673
 Jonkheer        0.000000
 Rev             0.000000
 Don             0.000000
 Capt            0.000000
Name: Survived, dtype: float64

In [15]:
df

                                                  Name  Survived  Title
0                              Braund, Mr. Owen Harris         0     Mr
1    Cumings, Mrs. John Bradley (Florence Briggs Th...         1    Mrs
2                               Heikkinen, Miss. Laina         1   Miss
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)         1    Mrs
4                             Allen, Mr. William Henry         0     Mr
..                                                 ...       ...    ...
886                              Montvila, Rev. Juozas         0    Rev
887                       Graham, Miss. Margaret Edith         1   Miss
888           Johnston, Miss. Catherine Helen "Carrie"         0   Miss
889                              Behr, Mr. Karl Howell         1     Mr
890                                Dooley, Mr. Patrick         0     Mr

[891 rows x 3 columns]

In [27]:
# df['Is_married'] = np.where(df['Title'] == 'Mrs', 1, 0)

#----------------------------------------------------------------------------------

# df['Is_married'] = 0
# df['Is_married'][df['Title'] == 'Mrs'] = 1  # This works but it gives u warning

#----------------------------------------------------------------------------------

df['Is_married'] = 0
df.loc[df['Title'] == 'Mrs', 'Is_married'] = 1

In [24]:
df['Title'] = df['Title'].str.strip()

In [ ]:
df['Title'].unique()

In [28]:
df

,Name,Survived,Title,Is_married
0,"Braund, Mr. Owen Harris",0,Mr,0
1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,Mrs,1
2,"Heikkinen, Miss. Laina",1,Miss,0
3,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,Mrs,1
4,"Allen, Mr. William Henry",0,Mr,0
...,...,...,...,...
886,"Montvila, Rev. Juozas",0,Rev,0
887,"Graham, Miss. Margaret Edith",1,Miss,0
888,"Johnston, Miss. Catherine Helen ""Carrie""",0,Miss,0
889,"Behr, Mr. Karl Howell",1,Mr,0
890,"Dooley, Mr. Patrick",0,Mr,0